#### Terraform Format and Style 🖌 `success` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github.github_team_repository.simde_terraform has been changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"c32f88cd298b4903f6e764f184e1fa42a9005db40e23b0f0e1d51285d41d3e5f\"" -> "W/\"346d2eff83e94d2b9b367f97ece01e9d97be15ead8033ecdac5e6c02fb16b602\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.github.module.repositories.github_branch_protection.gesasso_mkultra_master will be created
  + resource "github_branch_protection" "gesasso_mkultra_master" {
      + allows_deletions       = false
      + allows_force_pushes    = false
      + enforce_admins         = false
      + id                     = (known after apply)
      + pattern                = "main"
      + push_restrictions      = [
          + "MDQ6VGVhbTQyMTc3MzM=",
        ]
      + repository_id          = "MDEwOlJlcG9zaXRvcnkzNTMxNTM3MTc="
      + require_signed_commits = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + dismissal_restrictions          = [
              + "MDQ6VGVhbTQyMTc3MzM=",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }
    }

  # module.github.module.repositories.github_repository.gesasso_mkultra will be created
  + resource "github_repository" "gesasso_mkultra" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + auto_init              = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + description            = "Le nécessaire pour les mails"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = true
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "gesasso_mkmail"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

  # module.github.module.repositories.github_team_repository.gesasso_gesasso_mkultra will be created
  + resource "github_team_repository" "gesasso_gesasso_mkultra" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkmail"
      + team_id    = "4673796"
    }

  # module.github.module.repositories.github_team_repository.simde_gesasso_mkultra will be created
  + resource "github_team_repository" "simde_gesasso_mkultra" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "gesasso_mkmail"
      + team_id    = "4217733"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*